src/cf/DataProcessors/GDS_ПолучениеДанныхАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>GDS_ПолучениеДанныхАПП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ДанныеАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ДанныеАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ФайлыАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ФайлыАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_НастройкиПодключенияАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_НастройкиПодключенияАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодАутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_МетодыАутентификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВыгружаемыхДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЛичногоКабинета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИНН_Организации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/GDS_МетодыАутентификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_МетодыАутентификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Basic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OAuth2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвиационныйТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорскойТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/GDS_ПунктыПроверкиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>GDS_ПунктыПроверкиТС</Name>
			<Comment>Пункты проверки ТС для акта-приема пердачи</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМодели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыМоделейТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/GDS_ПолучениеДанныхАПП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ПараметрыЗапроса;

Перем ПараметрыЧекЛистов;

Перем ПараметрыЧекЛистовТекущейОрганизации;

Перем Сессия;

Перем ПараметрыПреобразованияJSON;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗапроситьДанныеИзСервисаЧекЛистов(ИНН, Ресурс, Идентификатор = "", РесурсУточнение = "", ИдентификаторФ = "") Экспорт
	
	НастроитьПодключениеПоОрганизации(ИНН);
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить(Ресурс);
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		ЧастиАдреса.Добавить(Идентификатор);
	КонецЕсли;
	Если ЗначениеЗаполнено(РесурсУточнение) Тогда
		ЧастиАдреса.Добавить(РесурсУточнение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ИдентификаторФ) Тогда
		ЧастиАдреса.Добавить(ИдентификаторФ);
	КонецЕсли;
			
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	//временно
	Если ЗначениеЗаполнено(ИдентификаторФ) Тогда
		Адрес = Адрес+"/data";
	КонецЕсли;
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения из ЛК", ОтветHTTP);
		Возврат ТекстОшибки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Идентификатор)
		И ИдентификаторФ = "" Тогда
		
		Данные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
		ОтветСервера = GDS_HTTPКоннектор.ОбъектВJson(Данные);

	Иначе
		Если ЗначениеЗаполнено(ИдентификаторФ) Тогда
			Данные = GDS_HTTPКоннектор.КакДвоичныеДанные(ОтветHTTP);
			ОтветСервера = Данные;
			ЭтотОбъект.ДДКартинки = Данные;
		Иначе
			Данные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
			ОтветСервера = GDS_HTTPКоннектор.ОбъектВJson(Данные);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОтветСервера;
	
КонецФункции


Функция ЗапроситьДатыИзСервисаЧекЛистов(ИНН, Ресурс, Идентификатор = "") Экспорт
	
	НастроитьПодключениеПоОрганизации(ИНН);
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить(Ресурс);
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	Адрес = Адрес + Идентификатор;
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения из ЛК", ОтветHTTP);
		Возврат ТекстОшибки;
	КонецЕсли;
	
	Данные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	ОтветСервера = Данные;//ЛК_HTTPКоннектор.ОбъектВJson(Данные);
	
	Возврат ОтветСервера;
	
КонецФункции

Процедура ПрочитатьЧекЛистыИзСервиса(ИНН) Экспорт
	
	НастроитьПодключениеПоОрганизации(ИНН);
	
	ДатаЗапроса = КонецДня(Константы.GDS_ДатаЗапросаИзСервисаАПП.Получить());//изменить на ТекущаяДатаСеанса()
	
	ДатаЗапросаISO = ЗаписатьДатуJSON(ДатаЗапроса,ФорматДатыJSON.ISO);
	
	ЧекЛистыСервиса = ЗагрузитьСписокЧекЛистовИзСервиса(ДатаЗапросаISO);
	Для Каждого ЧекЛистСервиса Из ЧекЛистыСервиса Цикл
		
		Попытка
			Чек_ID = ЧекЛистСервиса.Получить("id");
			
			ДеталиЧекЛиста = ЗагрузитьДеталиЧекЛистовИзСервиса(Чек_ID);
			
			//СтруктураСоответствия = СериализоватьВJSON(ДеталиЧекЛиста);
			
			ДанныеАПП = ПараметрыДанныеАПП();
			
			ТС_ID  = ЧекЛистСервиса.Получить("externalId");
			
			ПолучитьТСИзСервиса(ТС_ID, ДанныеАПП.ТС);
			
			Модель_ID = ДеталиЧекЛиста.Получить("МодельИД");
			
			ПолучитьМодельИзСервиса(Модель_ID, ДанныеАПП.Модель);
			
			ПУ_ID = ДеталиЧекЛиста.Получить("ПУИД");
			
			ПолучитьПУИзСервиса(ПУ_ID, ДанныеАПП.ПУ);
			
			Подразделение_ID = ДеталиЧекЛиста.Получить("ФлотИД");
			
			ПолучитьПодразделениеИзСервиса(Подразделение_ID, ДанныеАПП.Подразделение);
			
			Пользователь_ID = ЧекЛистСервиса.Получить("userId");
			
			ПолучитьПользователяИзСерсиса(Пользователь_ID, ДанныеАПП);
			
			ДанныеАПП.ТС.МотоЧасыТО     = ДеталиЧекЛиста.Получить("Показание моточасов с последнего ТО");
			ДанныеАПП.ТС.МотоЧасыФакт   = ДеталиЧекЛиста.Получить("Показание моточасов фактическое");
			ДанныеАПП.ТС.ОстатокТоплива = ДеталиЧекЛиста.Получить("Остаток топлива в баке (л)");
			ДанныеАПП.ТС.Пробег         = ДеталиЧекЛиста.Получить("Пробег (км)");
			ДанныеАПП.ТС.ПлатонНомер    = ДеталиЧекЛиста.Получить("инв№ Платон");
			ДанныеАПП.ТС.Комментарий    = ДеталиЧекЛиста.Получить("Комментарий тягача общий");
			
			//изменить дату на получение из формата ISO - ПрочитатьДатуJSON(Дата, ФорматДатыJSON.ISO)
			ДанныеАПП.ДатаОсмотра = ДатаЗапроса;
			
			СтрПользователь = ДеталиЧекЛиста.Получить("Пользователь");
			ДанныеАПП.Принял = СокрЛП(СтрПользователь);
			
			ДанныеАПП.ПрицепОборудование.ГосНомер       = ДеталиЧекЛиста.Получить("Гос. номер прицепа");
			ДанныеАПП.ПрицепОборудование.МотоЧасыТО     = ДеталиЧекЛиста.Получить("Показание моточасов с последнего ТО прицепа");
			ДанныеАПП.ПрицепОборудование.МотоЧасыФакт   = ДеталиЧекЛиста.Получить("Показание моточасов фактическое прицепа");
			ДанныеАПП.ПрицепОборудование.ОстатокТоплива = ДеталиЧекЛиста.Получить("Остаток топлива в баке (л) прицепа");
			ДанныеАПП.ПрицепОборудование.Пробег         = 0;
			ДанныеАПП.ПрицепОборудование.Комментарий    = ДеталиЧекЛиста.Получить("Комментарий прицепа общий");
			
			//РАЗБОР ОТВЕТОВ ПУНКТОВ ПРОВЕРКИ ЧЕРЕЗ РЕГУЛЯРНОЕ ВЫРАЖЕНИЕ
			ОтветСтрока = GDS_HTTPКоннектор.ОбъектВJson(ДеталиЧекЛиста);
			
			РезультатРазбора = РазборПоляЧерезРегулярноеВыражениеНаСервере(ОтветСтрока);
			ДобавитьПунктыПроверкиНаСервере(РезультатРазбора);
			
			ДанныеАПП.ЭлементыПроверки = РезультатРазбора;
			
			//ЗАПИШЕМ ИТОГ
			МенеджерЗаписи = РегистрыСведений.GDS_ДанныеАПП.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Идентификатор = Новый УникальныйИдентификатор(Чек_ID);
			МенеджерЗаписи.Данные = Новый ХранилищеЗначения(ДанныеАПП, Новый СжатиеДанных(9));
			
			МенеджерЗаписи.Записать();
			
			//РАЗБОР ПРИСОЕДИНЕННЫХ ФАЙЛОВ
			ЗагрузитьФайлыЧекЛистовИзСервиса(Чек_ID, РезультатРазбора.Вложение);
			
		Исключение
			сс="";
			//Данные = СтрШаблон("ИНН %1", ИНН);
			//ОтправляемыеДанные = ЛК_HTTPКоннектор.ОбъектВJson(Данные);
			//
			//ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			//ПредставлениеОшибкиДляПользователя = ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
			//
			//Комментарий = СтрШаблон("Отправляемые данные:
			//	|%1
			//	|Информация об ошибке для пользователя:
			//	|%2
			//	|Информация об ошибке:
			//	|%3", ОтправляемыеДанные, ПредставлениеОшибкиДляПользователя, ПредставлениеОшибки);
			//
			//ЗаписьЖурналаРегистрации("Обмен.ЛичныйКабинет", УровеньЖурналаРегистрации.Ошибка, , Данные, Комментарий);
			//
			//ПредставлениеОшибкиДляПользователя = ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
			//
			//РегистрыСведений.ЛК_ПроблемныеЗаявкиИзЛК.Записать(
			//	ЗаявкаЛК.id, 
			//	ЛК_HTTPКоннектор.ОбъектВJson(ЗаявкаЛК), 
			//	ЛК_HTTPКоннектор.ОбъектВJson(ДеталиЗаявки), 
			//	ИНН,
			//	ПредставлениеОшибкиДляПользователя
			//);
			//
			//ОтправитьОтклонениеЗаявки(ИНН, ЗаявкаЛК.id, ПредставлениеОшибкиДляПользователя);
			//
			////РегистрыСведений.ЛК_ПроблемныеЗаявкиИзЛК.ОтметитьОбработанным(
			////	ЗаявкаЛК.id, 
			////	ЛК_HTTPКоннектор.ОбъектВJson(ЗаявкаЛК), 
			////	ЛК_HTTPКоннектор.ОбъектВJson(ДеталиЗаявки), 
			////	ИНН,
			////	ПредставлениеОшибкиДляПользователя
			////);
			//
		КонецПопытки;
		//	
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПользователиЛК


#КонецОбласти

#Область ДокументыДляЛичногоКабинета

Процедура ОбработатьЧекЛист(ЧекЛист, ДеталиЧекЛист, ФайлыЧекЛист, ИНН)
	
	сс="";
	
	id = ЧекЛист.Получить("id");
	title = ЧекЛист.Получить("title");
	
	Описание = СтрШаблон("ЧекЛист/%1/%2", title, id);

	Запись = РегистрыСведений.GDS_ОчередьСообщенийЧекЛист.СоздатьМенеджерЗаписи();
	//ЗаполнитьЗначенияСвойств(Запись, Сообщение);
	Запись.Период = ТекущаяДатаСеанса();
	Запись.ИНН = ИНН;
	Запись.Описание = Описание;
	
	Запись.Статус = Перечисления.ЛК_СтатусСообщения.Ожидает;
	Запись.Сообщение    = ДеталиЧекЛист;
	Запись.УИНСообщения = id;
	
	Запись.ДанныеТС = Новый ХранилищеЗначения(ЧекЛист);
	Запись.ДопДанные = Новый ХранилищеЗначения(ФайлыЧекЛист);
	
	
	
	
	Запись.Записать(Истина);
	
	
	
	
	
КонецПроцедуры

Процедура ОбработатьДанныеТехники(ДанныеТС, ДанныеПрицеп)
	
	МенеджерЗаписи = РегистрыСведений.GDS_СведенияОТехнике.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ДанныеТС);
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.GDS_СведенияОТехнике.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ДанныеПрицеп);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ОбработатьДанныеЧекЛист(ЧекЛист, ДанныеРазбора)

	ДанныеТягача  = ДанныеРазбора.ДанныеТягача;
	ДанныеПрицепа = ДанныеРазбора.ДанныеПрицепа;
	
	id = ЧекЛист.Получить("id");
		
	Если ДанныеТягача.Количество() > 0 Тогда
		
		ТЧ_Данных = РегистрыСведений.GDS_СоответствиеДанныхЧекЛисты.СоответствиеВидовРаспознаваемыхДанных(Перечисления.GDS_ВидМоделиТС.Автотранспорт);
		
		НаборЗаписей = РегистрыСведений.GDS_СведенияОЧекЛисте.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(id);
		Для Каждого СтрТягач Из ДанныеТягача Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Идентификатор		= id;
			НоваяЗапись.Пункт				= ОпределитьПунктПроверки(СтрТягач.Пункт, ТЧ_Данных,Перечисления.GDS_ВидМоделиТС.Автотранспорт);
			НоваяЗапись.ВидМодели			= Перечисления.GDS_ВидМоделиТС.Автотранспорт;
			НоваяЗапись.СостояниеПроверки	= ОпределитьПризнакСостоянияПроверки(СтрТягач.Ответ.Радиокнопка);
			НоваяЗапись.Комментарий			= СтрТягач.Ответ.Комментарий;
			НоваяЗапись.Вложение			= ОпределитьПризнакВложения(СтрТягач.Ответ.Вложение);
			
		КонецЦикла;
		
		НаборЗаписей.Записать(); 
	КонецЕсли;
	
	Если ДанныеПрицепа.Количество() > 0 Тогда
		
		ТЧ_Данных = РегистрыСведений.GDS_СоответствиеДанныхЧекЛисты.СоответствиеВидовРаспознаваемыхДанных(Перечисления.GDS_ВидМоделиТС.Прицеп);
		
		НаборЗаписей = РегистрыСведений.GDS_СведенияОЧекЛисте.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(id);
		НаборЗаписей.Прочитать();
		Для Каждого СтрПрицеп Из ДанныеПрицепа Цикл
			НоваяЗапись = НаборЗаписей.Добавить();

			НоваяЗапись.Идентификатор		= id;
			НоваяЗапись.Пункт				= ОпределитьПунктПроверки(СтрПрицеп.Пункт, ТЧ_Данных, Перечисления.GDS_ВидМоделиТС.Автотранспорт);
			НоваяЗапись.ВидМодели			= Перечисления.GDS_ВидМоделиТС.Прицеп;
			НоваяЗапись.СостояниеПроверки	= ОпределитьПризнакСостоянияПроверки(СтрПрицеп.Ответ.Радиокнопка);
			НоваяЗапись.Комментарий			= СтрПрицеп.Ответ.Комментарий;
			НоваяЗапись.Вложение			= ОпределитьПризнакВложения(СтрПрицеп.Ответ.Вложение);
			
		КонецЦикла;
		
		НаборЗаписей.Записать(); 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруИзСоответствия(ЗначВход)
	
	СтруктураВозврат=Новый Структура;
	
	Если ТипЗнч(ЗначВход)=Тип("Соответствие") Тогда
		
		ФлагОщибка=Ложь;
		
		Для Каждого р Из ЗначВход Цикл
			Попытка
				СтруктураВозврат.Вставить(р.Ключ,ПолучитьСтруктуруИзСоответствия(р.Значение));
			Исключение
				ФлагОщибка=Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
		
		Если ФлагОщибка Тогда // пришел ключь который не возможно поместить в структуру
			СтруктураВозврат = Новый Массив;
			Для Каждого р Из ЗначВход Цикл
				ДопСтруктура=Новый Структура;
				ДопСтруктура.Вставить("Ключ",р.Ключ);
				ДопСтруктура.Вставить("Значение",ПолучитьСтруктуруИзСоответствия(р.Значение));
				СтруктураВозврат.Добавить(ДопСтруктура);
			КонецЦикла;
		КонецЕсли;
		
		Возврат СтруктураВозврат; 
		
	ИначеЕсли ТипЗнч(ЗначВход)=Тип("Массив") Тогда
		
		НовыйМассив=Новый Массив;
		Для Каждого ЭлМ Из ЗначВход Цикл
			НовыйМассив.Добавить(ПолучитьСтруктуруИзСоответствия(ЭлМ));
		КонецЦикла;
		Возврат НовыйМассив;
		
	КонецЕсли;
	
	Возврат ЗначВход; 
	
КонецФункции

#КонецОбласти

#Область ЧекЛистыИзСервиса

Функция ЗагрузитьСписокЧекЛистовИзСервиса(ДатаЗапроса)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("checkLists/search/by_date?date=");//"checkLists/list_all"
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	Адрес = Адрес + ДатаЗапроса;
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения чек-листов из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	Заявки = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	Возврат Заявки;
	
КонецФункции

Функция ЗагрузитьДеталиЧекЛистовИзСервиса(ИдЧекЛиста)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("checkLists");
	ЧастиАдреса.Добавить(ИдЧекЛиста);
	ЧастиАдреса.Добавить("details/out");
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ДеталиЧекЛиста = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	//ДеталиЗаявки = GDS_HTTPКоннектор.ОбъектВJson(ДеталиЧекЛиста);
	
	Возврат ДеталиЧекЛиста;
	
КонецФункции

Функция ЗагрузитьЧекЛистИзСервиса(ИдЧекЛиста)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("checkListEvents?parentId=");
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	Адрес = Адрес + ИдЧекЛиста;
	
	//ПараметрыЗапроса = Новый Соответствие;
	//ПараметрыЗапроса.Вставить("checkListEvents?parentId=", ИдЧекЛиста);
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ДеталиЧекЛиста = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	//ДеталиЗаявки = GDS_HTTPКоннектор.ОбъектВJson(ДеталиЧекЛиста);
	
	Возврат ДеталиЧекЛиста;
	
КонецФункции

Процедура ПолучитьТСИзСервиса(ИдТС, ДеталиТС)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("cars");
	ЧастиАдреса.Добавить(ИдТС);
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ОтветДанные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	ДеталиТС.Ид = ОтветДанные.Получить("externalId");
	ДеталиТС.Наименование = ОтветДанные.Получить("title");
	ДеталиТС.ГосНомер = ОтветДанные.Получить("registrationPlate");
	
КонецПроцедуры

Процедура ПолучитьМодельИзСервиса(ИдМодели, ДеталиМодели)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("carModels");
	ЧастиАдреса.Добавить(ИдМодели);
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ОтветДанные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	ДеталиМодели.Ид = ОтветДанные.Получить("externalId");
	ДеталиМодели.Наименование = ОтветДанные.Получить("title");
	
КонецПроцедуры

Процедура ПолучитьПУИзСервиса(ИдПУ, ДеталиПУ)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("productionSections");
	ЧастиАдреса.Добавить(ИдПУ);
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ОтветДанные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	ДеталиПУ.Ид = ОтветДанные.Получить("externalId");
	ДеталиПУ.Наименование = ОтветДанные.Получить("title");
	
КонецПроцедуры

Процедура ПолучитьПодразделениеИзСервиса(ИдПодразделение, ДеталиПодразделение)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("vehicleFleets");
	ЧастиАдреса.Добавить(ИдПодразделение);
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ОтветДанные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	ДеталиПодразделение.Ид = ОтветДанные.Получить("externalId");
	ДеталиПодразделение.Наименование = ОтветДанные.Получить("title");
	
КонецПроцедуры

Процедура ПолучитьПользователяИзСерсиса(ИдПользователя, ДеталиАПП)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("users");
	ЧастиАдреса.Добавить(ИдПользователя);
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ОтветДанные = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	ДеталиАПП.Принял = ОтветДанные.Получить("externalId");
	//ДеталиПодразделение.Наименование = ОтветДанные.Получить("title");
	
КонецПроцедуры

Процедура ЗагрузитьФайлыЧекЛистовИзСервиса(ИдЧекЛиста, НаимФайлов)
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("checkLists");
	ЧастиАдреса.Добавить(ИдЧекЛиста);
	ЧастиАдреса.Добавить("files");
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес, , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ФайлыЧекЛистов = GDS_HTTPКоннектор.КакJson(ОтветHTTP, ПараметрыПреобразованияJSON);
	
	МассивФайлов = Новый Массив;
	//	Если ФайлыЧекЛистов.Количество()>1 Тогда
	Для Каждого СтрФайл Из ФайлыЧекЛистов Цикл
		Файл_ID = СтрФайл.Получить("id");
		
		ИмяДляРасширения = СтрФайл.Получить("filename");
		Расширение = ПолучитьРасширениеИмениФайла(ИмяДляРасширения);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Файл",СтрФайл.Получить("filename"));
		
		ТЧ_Файлов = МассивСтруктурВТаблицуЗначений(НаимФайлов);
		
		Если НаимФайлов.Количество() > 0 Тогда
			МассивСтр = ТЧ_Файлов.НайтиСтроки(СтруктураПоиска);
			Если МассивСтр.Количество() = 1 Тогда
				ИмяФайла = МассивСтр[0].Пункт;
			Иначе
				Если СтрНайти(СтрФайл.Получить("filename"),"CAP") > 0 Тогда
					ИмяФайла = "Фото сотрудника";
				Иначе
					ИмяФайла = СтрФайл.Получить("filename");
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если СтрНайти(СтрФайл.Получить("filename"),"CAP") > 0 Тогда
				ИмяФайла = "Фото сотрудника";
			Иначе
				ИмяФайла = СтрФайл.Получить("filename");
			КонецЕсли;
		КонецЕсли;
		
		Размер = СтрФайл.Получить("size");//байт
		ДД_Файла = ЗагрузитьМассивФайловЧекЛистовИзСервиса(ИдЧекЛиста, Файл_ID);
		
		ПараметрыФайлов = ПараметрыФайловАПП();
		ПараметрыФайлов.ИдентификаторФайла = Новый УникальныйИдентификатор(Файл_ID);
		ПараметрыФайлов.Имя = ИмяФайла;
		ПараметрыФайлов.Размер = Размер;
		ПараметрыФайлов.Расширение = Расширение;
		ПараметрыФайлов.ДвоичныеДанныеФайла = ДД_Файла;
		
		МассивФайлов.Добавить(ПараметрыФайлов);
		
	КонецЦикла;
	//	КонецЕсли;
	
	РегистрыСведений.GDS_ФайлыАПП.ДобавитьЗапись(Новый УникальныйИдентификатор(ИдЧекЛиста), МассивФайлов);
	
КонецПроцедуры

Функция ЗагрузитьМассивФайловЧекЛистовИзСервиса(ИдЧекЛиста, ИдФайла)
	
	
	ЧастиАдреса = Новый Массив;
	ЧастиАдреса.Добавить(ПараметрыЧекЛистовТекущейОрганизации.Адрес);
	ЧастиАдреса.Добавить("checkLists");
	ЧастиАдреса.Добавить(ИдЧекЛиста);
	ЧастиАдреса.Добавить("files");
	ЧастиАдреса.Добавить(ИдФайла);
	Адрес = СтрСоединить(ЧастиАдреса, "/");
	
	ОтветHTTP = GDS_HTTPКоннектор.Get(Адрес+"/data", , , Сессия);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = ТекстСообщенияОбОшибке("Ошибка чтения деталей чек-листа из сервиса", ОтветHTTP);
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	
	ДДЧекЛиста = GDS_HTTPКоннектор.КакДвоичныеДанные(ОтветHTTP);;
	
	Возврат ДДЧекЛиста
	
КонецФункции

#КонецОбласти

#КонецОбласти

Функция МассивСтруктурВТаблицуЗначений(МассивСтруктур)

	ТаблицаЗначений = Новый ТаблицаЗначений;
	ДобавлятьКолонки = Истина;
	
	Для каждого СтруктураСтроки Из МассивСтруктур Цикл
		
		Если ДобавлятьКолонки Тогда
			Для каждого ЭлементСтруктуры Из СтруктураСтроки Цикл
				ТаблицаЗначений.Колонки.Добавить(ЭлементСтруктуры.Ключ);
			КонецЦикла;
			ДобавлятьКолонки = Ложь;
		КонецЕсли;

		НоваяСтрока = ТаблицаЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки); 
	
	КонецЦикла;

	Возврат ТаблицаЗначений;

КонецФункции // МассивСтруктурВТаблицуЗначений()

Процедура НастроитьПодключениеПоОрганизации(ИНН)
	
	Если ЗначениеЗаполнено(ПараметрыЧекЛистовТекущейОрганизации) 
		И ПараметрыЧекЛистовТекущейОрганизации.ИНН = ИНН Тогда
		
		Возврат;
	КонецЕсли;
	
	ЗапроситьТокенOAuth2(ИНН);
	ПараметрыЧекЛистовТекущейОрганизации = ПараметрыЧекЛистов.Получить(ИНН);
	Сессия = GDS_HTTPКоннектор.СоздатьСессию();
	Сессия.Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЧекЛистовТекущейОрганизации.ТокенДоступа);
	Сессия.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
КонецПроцедуры

Процедура Иницаилизировать()
	
	ПараметрыЗапроса = GDS_HTTPКоннектор.НовыеПараметры();
	ЗаполнитьПараметрыСоединенияОрганизации();
	ПараметрыПреобразованияJSON = ПараметрыПреобразованияJSONПоУмолчанию();
	
КонецПроцедуры

Процедура ЗапроситьТокенOAuth2(ИНН)
	
	ПараметрыСоединения = ПараметрыЧекЛистов.Получить(ИНН);
	
	Если ПараметрыСоединения.МетодАутентификации <> Перечисления.GDS_МетодыАутентификации.OAuth2 Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("code", "AUTH_CODE");
	Данные.Вставить("client_id", "app");
	Данные.Вставить("redirect_uri", ПараметрыСоединения.Адрес);
	Данные.Вставить("grant_type", "password");
	Данные.Вставить("username", ПараметрыСоединения.Логин);
	Данные.Вставить("password", ПараметрыСоединения.Пароль);
	
	Параметры = GDS_HTTPКоннектор.НовыеПараметры();
	Параметры.Данные = Данные;
	
	Ответ = GDS_HTTPКоннектор.Post("https://check-car.itjn.ru:8079/realms/check-car/protocol/openid-connect/token", , Параметры);
	ОтветЛК = GDS_HTTPКоннектор.КакJson(Ответ);
		
	ПараметрыСоединения.ТокенОбновления = ОтветЛК.Получить("refresh_token");
	ПараметрыСоединения.ТокенДоступа = ОтветЛК.Получить("access_token");
	ТекущийТокенДоступа = ПараметрыСоединения.ТокенДоступа;
	
	ПараметрыЧекЛистов.Вставить(ИНН, ПараметрыСоединения);
	
КонецПроцедуры

Функция ПараметрыПреобразованияJSONПоУмолчанию()
	
	ПараметрыПреобразованияПоУмолчанию = Новый Структура;
	ПараметрыПреобразованияПоУмолчанию.Вставить("ПрочитатьВСоответствие", Истина);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ФорматДатыJSON", ФорматДатыJSON.ISO);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИменаСвойствСоЗначениямиДата", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ВариантЗаписиДатыJSON", ВариантЗаписиДатыJSON.ЛокальнаяДата);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИмяФункцииПреобразования", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("МодульФункцииПреобразования", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ДополнительныеПараметрыФункцииПреобразования", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИмяФункцииВосстановления", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("МодульФункцииВосстановления", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ДополнительныеПараметрыФункцииВосстановления", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("ИменаСвойствДляОбработкиВосстановления", Неопределено);
	ПараметрыПреобразованияПоУмолчанию.Вставить("МаксимальнаяВложенность", 500);
	
	Возврат ПараметрыПреобразованияПоУмолчанию;
	
КонецФункции

Функция УбратьЛишниеСимволы(Знач ВходящаяСтрока)
	ПолученнаяСтрока = ВходящаяСтрока;
	ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, " ", "");
	ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, " ", "");
	ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, "[", "");
	ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, "]", "");
	ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, "\", "");
	ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, """", "");
	
	Возврат ПолученнаяСтрока;
КонецФункции

Функция ОпределитьПризнакВложения(ПризнакВложения)
	
	ЕстьВложение = Перечисления.GDS_ПризнакВложения.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ПризнакВложения) Тогда
		ЕстьВложение = Перечисления.GDS_ПризнакВложения.Присутствует;
	Иначе
		ЕстьВложение = Перечисления.GDS_ПризнакВложения.Отсутствует;
	КонецЕсли;
	
	Возврат ЕстьВложение;
	
КонецФункции

Функция ОпределитьПризнакСостоянияПроверки(ПризнакСостояния)
	
	Состояние = Перечисления.GDS_СостояниеПроверки.ПустаяСсылка();
	
	Если ПризнакСостояния = "Исправно" Тогда
		Состояние = Перечисления.GDS_СостояниеПроверки.Исправно;
	ИначеЕсли ПризнакСостояния = "В наличии" Тогда
		Состояние = Перечисления.GDS_СостояниеПроверки.ВНаличии;
	ИначеЕсли ПризнакСостояния = "Неисправно" Тогда
		Состояние = Перечисления.GDS_СостояниеПроверки.Неисправно;
	ИначеЕсли ПризнакСостояния = "Отсутствует" Тогда
		Состояние = Перечисления.GDS_СостояниеПроверки.Отсутствует;
	ИначеЕсли ПризнакСостояния = "Просрочено" Тогда
		Состояние = Перечисления.GDS_СостояниеПроверки.Просрочено;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

Функция ОпределитьПунктПроверки(Пункт, ТЧ_Поиска, ВидМодели)
	
	ПунктПоиска = Справочники.GDS_ПунктыПроверкиТС.ПустаяСсылка();
	
	Отбор = Новый Структура("ДанныеСервиса,",Пункт); 
	
	МассивСтрок = ТЧ_Поиска.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() =1 Тогда
		Возврат МассивСтрок[0].ДанныеИБ;
	Иначе
		сс="";
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьПараметрыСоединенияОрганизации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_НастройкиПодключенияАПП.URL КАК URL,
	|	GDS_НастройкиПодключенияАПП.Логин КАК Логин,
	|	GDS_НастройкиПодключенияАПП.Пароль КАК Пароль,
	|	GDS_НастройкиПодключенияАПП.ТокенОбновления КАК ТокенОбновления,
	|	GDS_НастройкиПодключенияАПП.ТокенДоступа КАК ТокенДоступа,
	|	GDS_НастройкиПодключенияАПП.ИНН_Организации КАК ИНН,
	|	GDS_НастройкиПодключенияАПП.МетодАутентификации КАК МетодАутентификации,
	|	GDS_НастройкиПодключенияАПП.КоличествоВыгружаемыхДокументов КАК КоличествоВыгружаемыхДокументов,
	|	GDS_НастройкиПодключенияАПП.ИдентификаторЛичногоКабинета КАК ИдентификаторЛичногоКабинета
	|ИЗ
	|	РегистрСведений.GDS_НастройкиПодключенияАПП КАК GDS_НастройкиПодключенияАПП";
	
	ПараметрыЧекЛистов = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыСоединения = НовыйПараметрыСоединения();
		ЗаполнитьЗначенияСвойств(ПараметрыСоединения, Выборка);
		ПараметрыСоединения.Адрес = "https://" + Выборка.URL;
		
		ПараметрыЧекЛистов.Вставить(Выборка.ИНН, ПараметрыСоединения);
	КонецЦикла;

КонецПроцедуры

Функция НовыйПараметрыСоединения()
	
	Параметры = Новый Структура;
	Параметры.Вставить("URL", "");
	Параметры.Вставить("Логин", "");
	Параметры.Вставить("Пароль", "");
	Параметры.Вставить("ТокенОбновления", "");
	Параметры.Вставить("ТокенДоступа", "");
	Параметры.Вставить("МетодАутентификации", "");
	Параметры.Вставить("LKToken", "");
	Параметры.Вставить("HTTPСоединение");
	Параметры.Вставить("ИНН", "");
	Параметры.Вставить("Адрес", "");
	Параметры.Вставить("КоличествоВыгружаемыхДокументов", 100);
	Параметры.Вставить("ИдентификаторЛичногоКабинета", "");
	
	Возврат Параметры;
	
КонецФункции

Функция ТекстСообщенияОбОшибке(ОписаниеДействия, ОтветHTTP, ДанныеЗапроса = Неопределено)
	ШаблонСообщения = НСтр("ru = '%1. 
	                             |Код состояния %2. 
	                             |Ответ сервера %3.
	                             |Данные отправки %4'");
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		ОписаниеДействия,
		ОтветHTTP.КодСостояния,
		GDS_HTTPКоннектор.КакТекст(ОтветHTTP),
		?(ЗначениеЗаполнено(ДанныеЗапроса), GDS_HTTPКоннектор.ОбъектВJson(ДанныеЗапроса), "")
	);
	
	Возврат ТекстОшибки;
КонецФункции

функция ПолучитьJSONстроку(Данные)
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Данные); 
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
КонецФункции

Функция ПрочитатьСтруктуруИзJSON(Результат)
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.ОткрытьПоток(Результат.ПолучитьТелоКакПоток());
	ДокументОтвет = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ДокументОтвет;
КонецФункции

Функция СериализоватьВJSON(ДанныеДляСериализации)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляСериализации);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

функция РазборПоляЧерезРегулярноеВыражениеНаСервере(ДеталиЧекЛист)
	
	СтруктураВозврата = Новый Структура;
	
	МассивПоиска = Новый Массив;
	МассивПоиска.Добавить("тягача");
	МассивПоиска.Добавить("прицепа");
	МассивПоиска.Добавить("ТС");
	
	ТЧ_Вложений = Новый ТаблицаЗначений;
	ТЧ_Вложений.Колонки.Добавить("Пункт");
	ТЧ_Вложений.Колонки.Добавить("Файл");
	
	//КОРРЕКТИРОВКА
	МассивВложений = Новый Массив;
	
	НовыйМеханизм = Ложь;
	
	Если НовыйМеханизм Тогда
		
		Для Каждого СтрМ Из МассивПоиска Цикл
			
			ШаблонВыражения = "([^""]*?)\s*"+СтрМ+"\s*\{(радиокнопка|слайдер|комментарий|вложение)\}"":\s*""((?:[^""\\]|\\.)*)""(?=\s*,|\s*\}|$)";
			
			Если СтрМ = "ТС" Тогда
				НаименованиеТаблицы = "Данные"+СтрМ;
			Иначе
				НаименованиеТаблицы = "Данные"+ТРег(СтрМ);
			КонецЕсли;
			
			НазваниеТаблицы = Новый ТаблицаЗначений;
			НазваниеТаблицы.Колонки.Добавить("Пункт");
			НазваниеТаблицы.Колонки.Добавить("Ответ");
			
			МассивОтвета = Новый Массив;
			
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("Пункт");
			СтруктураОтвета.Вставить("Ответ", Новый Структура("Значение, Комментарий, Вложение"));
			
			Результаты = СтрНайтиВсеПоРегулярномуВыражению(ДеталиЧекЛист,ШаблонВыражения,,Истина);
			Для Каждого Результат Из Результаты Цикл
				ГруппыРезультата = Результат.ПолучитьГруппы();
				
				МассивРезультатов = Новый Массив;
				Для каждого ГруппаРезультата Из ГруппыРезультата Цикл
					МассивРезультатов.Добавить(ГруппаРезультата.Значение);
				КонецЦикла;
				//МассивОтвета.Добавить(СтрСоединить(МассивРезультатов, "/"));
				
				СтруктураОтвета.Пункт = ГруппыРезультата[0].Значение;
				СтруктураОтвета.Ответ.Значение = ГруппыРезультата[2].Значение;
				//СтруктураОтвета.Ответ.Комментарий = "";
				//СтруктураОтвета.Ответ.Вложение = "";
				
			КонецЦикла;
			
			СтруктураВозврата.Вставить(НаименованиеТаблицы,МассивОтвета);
			
		КонецЦикла;
		
		Возврат СтруктураВозврата;
		
	Иначе
		Для Каждого СтрМ Из МассивПоиска Цикл
			
			РегулярноеВыражение = "([^""]*?)\s*"+СтрМ+"\s*\{(радиокнопка|слайдер|комментарий|вложение)\}"":\s*""((?:[^""\\]|\\.)*)""(?=\s*,|\s*\}|$)";
			
			//"([^""]*?)\s*"+СтрМ+"\s*\{(радиокнопка|слайдер|комментарий|вложение)\}"":\s*""([^""]*)""(?=\s*,|\s*\}|$)";
			//"([^""]*?)\s*"+СтрМ+"\s*\{(радиокнопка|слайдер|комментарий|вложение)\}"":\s*""?(.*?)""?(?=\s*,|\s*\})";
			
			Если СтрМ = "ТС" Тогда
				НаименованиеТаблицы = "Данные"+СтрМ;
			Иначе
				НаименованиеТаблицы = "Данные"+ТРег(СтрМ);
			КонецЕсли;
			
			НазваниеТаблицы = Новый ТаблицаЗначений;
			НазваниеТаблицы.Колонки.Добавить("Пункт");
			НазваниеТаблицы.Колонки.Добавить("Ответ");
			
			МассивРВ = СтрНайтиВсеПоРегулярномуВыражению(ДеталиЧекЛист,РегулярноеВыражение,,Истина);
			Если МассивРВ.Количество() > 0 Тогда
				Для Каждого СтрРВ Из МассивРВ Цикл
					ГруппаМ = СтрРВ.ПолучитьГруппы();
					
					ПараметрыОтвета = Новый Структура;
					ПараметрыОтвета.Вставить("Радиокнопка");
					ПараметрыОтвета.Вставить("Комментарий");
					ПараметрыОтвета.Вставить("Вложение");
					
					МассивСтрок = НазваниеТаблицы.НайтиСтроки(Новый Структура("Пункт", ГруппаМ[0].Значение));
					Если МассивСтрок.Количество() > 0 Тогда
						НоваяСтрока = МассивСтрок[0]; 
					Иначе
						НоваяСтрока = НазваниеТаблицы.Добавить();
						НоваяСтрока.Пункт = ГруппаМ[0].Значение;
						НоваяСтрока.Ответ = ПараметрыОтвета; 
					КонецЕсли;
					
					//исправить слайдет - тех.долг
					Если ГруппаМ[1].Значение = "слайдер" Тогда
						НоваяСтрока.Ответ["Радиокнопка"] = ГруппаМ[2].Значение;
					Иначе
						НоваяСтрока.Ответ[ГруппаМ[1].Значение] = ГруппаМ[2].Значение;
					КонецЕсли;
					
					Если ГруппаМ[1].Значение = "вложение" Тогда
						ДобавитьПунктФайл(ТЧ_Вложений, ГруппаМ[0].Значение, ГруппаМ[2].Значение);
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			НазваниеТаблицы.Сортировать("Пункт");
			
			МассивСтруктур = ОбщегоНазначения.ТаблицаЗначенийВМассив(НазваниеТаблицы);
			
			СтруктураВозврата.Вставить(НаименованиеТаблицы, МассивСтруктур);
			
		КонецЦикла;
		
		МассивВложений = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЧ_Вложений);
		
		СтруктураВозврата.Вставить("Вложение",МассивВложений);
		
		//найдем остатки без приписки ТС, тягач, прицеп
		РегулярноеВыражениеОстатки = """((?!.*тягача|.*прицепа|.*ТС)[^""]*?)\s+\{(радиокнопка|слайдер|комментарий|вложение)\}"":\s*""((?:[^""\\]|\\.)*)";
		
		НаименованиеТаблицы = "ДанныеОстатки";
		
		НазваниеТаблицы = Новый ТаблицаЗначений;
		НазваниеТаблицы.Колонки.Добавить("Пункт");
		НазваниеТаблицы.Колонки.Добавить("Ответ");
		
		МассивРВ_Остатки = СтрНайтиВсеПоРегулярномуВыражению(ДеталиЧекЛист,РегулярноеВыражениеОстатки,,);
		Если МассивРВ_Остатки.Количество() > 0 Тогда
			Для Каждого СтрРВ Из МассивРВ_Остатки Цикл
				ГруппаМ = СтрРВ.ПолучитьГруппы();
				
				ПараметрыОтвета = Новый Структура;
				ПараметрыОтвета.Вставить("Радиокнопка");
				ПараметрыОтвета.Вставить("Комментарий");
				ПараметрыОтвета.Вставить("Вложение");
				
				МассивСтрок = НазваниеТаблицы.НайтиСтроки(Новый Структура("Пункт", ГруппаМ[0].Значение));
				Если МассивСтрок.Количество() > 0 Тогда
					НоваяСтрока = МассивСтрок[0]; 
				Иначе
					НоваяСтрока = НазваниеТаблицы.Добавить();
					НоваяСтрока.Пункт = ГруппаМ[0].Значение;
					НоваяСтрока.Ответ = ПараметрыОтвета; 
				КонецЕсли;
				
				//исправить слайдет - тех.долг
				Если ГруппаМ[1].Значение = "слайдер" Тогда
					НоваяСтрока.Ответ["Радиокнопка"] = ГруппаМ[2].Значение;
				Иначе
					НоваяСтрока.Ответ[ГруппаМ[1].Значение] = ГруппаМ[2].Значение;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		НазваниеТаблицы.Сортировать("Пункт");
		
		МассивСтруктур = ОбщегоНазначения.ТаблицаЗначенийВМассив(НазваниеТаблицы);
		
		СтруктураВозврата.Вставить(НаименованиеТаблицы, МассивСтруктур);
		
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьПунктФайл(ТЧ,ЗначениеНаименование,ЗначениеФайл)
	
	СтрокаФайл = УбратьЛишниеСимволы(ЗначениеФайл);
	
	МассивСтрок = СтрРазделить(СтрокаФайл,",");
	
	Для Каждого СтрМ Из МассивСтрок Цикл
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Пункт = ЗначениеНаименование;
		НоваяСтрока.Файл = СтрМ;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПунктыПроверкиНаСервере(СтруктураРазбора)
	
	Для Каждого СтрТягача Из СтруктураРазбора.ДанныеТягача Цикл
		СоздатьПунктыПровекиИзРазбора(СтрТягача.Пункт, Перечисления.уатВидыМоделейТС.Автотранспорт);
	КонецЦикла;
	
	Для Каждого СтрПрицеп Из СтруктураРазбора.ДанныеПрицепа Цикл
		СоздатьПунктыПровекиИзРазбора(СтрПрицеп.Пункт, Перечисления.уатВидыМоделейТС.Прицеп);
	КонецЦикла;
	
	Для Каждого СтрПрицеп Из СтруктураРазбора.ДанныеТС Цикл
		СоздатьПунктыПровекиИзРазбора(СтрПрицеп.Пункт, Перечисления.уатВидыМоделейТС.Автотранспорт);
	КонецЦикла;
	
	Для Каждого СтрПрицеп Из СтруктураРазбора.ДанныеОстатки Цикл
		СоздатьПунктыПровекиИзРазбора(СтрПрицеп.Пункт, Перечисления.уатВидыМоделейТС.ПустаяСсылка());
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПунктыПровекиИзРазбора(Пункт, ВидМодели)
	
	ПунктПроверки = Справочники.GDS_ПунктыПроверкиТС.НайтиПоНаименованию(Пункт);
	
	Если ПунктПроверки = Справочники.GDS_ПунктыПроверкиТС.ПустаяСсылка() Тогда
		НовыйПунктПроверки = Справочники.GDS_ПунктыПроверкиТС.СоздатьЭлемент();
		//НовыйПунктПроверки.УстановитьНовыйКод();
		НовыйПунктПроверки.Наименование = Пункт;
		НовыйПунктПроверки.ВидМодели    = ВидМодели;
		НовыйПунктПроверки.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРасширениеИмениФайла(Знач ИмяФайла)
	
	РасширениеФайла = "";
	МассивСтрок = СтрРазделить(ИмяФайла, ".", Ложь);
	Если МассивСтрок.Количество() > 1 Тогда
		РасширениеФайла = МассивСтрок[МассивСтрок.Количество() - 1];
	КонецЕсли;
	Возврат РасширениеФайла;
	
КонецФункции

Функция ПараметрыФайловАПП()
	
	ПараметрыФайлов = Новый Структура;
	ПараметрыФайлов.Вставить("ИдентификаторФайла", "");
	ПараметрыФайлов.Вставить("Имя", "");
	ПараметрыФайлов.Вставить("Размер", "");
	ПараметрыФайлов.Вставить("Расширение", "");
	ПараметрыФайлов.Вставить("ДвоичныеДанныеФайла", "");
	
	Возврат ПараметрыФайлов;
	
КонецФункции

Функция ПараметрыДанныеАПП()
	
	ДанныеАПП = Новый Структура;
	ДанныеАПП.Вставить("ДатаОсмотра");
	ДанныеАПП.Вставить("Принял");
	ДанныеАПП.Вставить("ЭлементыПроверки");
	ДанныеАПП.Вставить("ТС", ПараметрыДанныеТС());
	ДанныеАПП.Вставить("ПрицепОборудование", ПараметрыДанныеПрицепОборудование());
	ДанныеАПП.Вставить("Модель", ПараметрыДанныеМодели());
	ДанныеАПП.Вставить("ПУ", ПараметрыДанныеПУ());
	ДанныеАПП.Вставить("Подразделение", ПараметрыДанныеПодразделение());
	
	Возврат ДанныеАПП;
	
КонецФункции

Функция ПараметрыДанныеТС()
	
	ДанныеТС = Новый Структура;
	ДанныеТС.Вставить("Ид");
	ДанныеТС.Вставить("Наименование");
	ДанныеТС.Вставить("ГосНомер");
	ДанныеТС.Вставить("МотоЧасыТО");
	ДанныеТС.Вставить("МотоЧасыФакт");
	ДанныеТС.Вставить("ОстатокТоплива");
	ДанныеТС.Вставить("Пробег");
	ДанныеТС.Вставить("ПлатонНомер");
	ДанныеТС.Вставить("Комментарий");
	
	Возврат ДанныеТС;
	
КонецФункции

Функция ПараметрыДанныеМодели()
	
	ДанныеМодели = Новый Структура;
	ДанныеМодели.Вставить("Ид");
	ДанныеМодели.Вставить("Наименование");
	
	Возврат ДанныеМодели;
	
КонецФункции

Функция ПараметрыДанныеПУ()
	
	ДанныеПУ = Новый Структура;
	ДанныеПУ.Вставить("Ид");
	ДанныеПУ.Вставить("Наименование");
	
	Возврат ДанныеПУ;
	
КонецФункции

Функция ПараметрыДанныеПодразделение()
	
	ДанныеПодразделение = Новый Структура;
	ДанныеПодразделение.Вставить("Ид");
	ДанныеПодразделение.Вставить("Наименование");
	
	Возврат ДанныеПодразделение;
	
КонецФункции

Функция ПараметрыДанныеПрицепОборудование()
	
	ДанныеПрицепОборудование = Новый Структура;
	ДанныеПрицепОборудование.Вставить("Ид");
	ДанныеПрицепОборудование.Вставить("Наименование");
	ДанныеПрицепОборудование.Вставить("ГосНомер");
	ДанныеПрицепОборудование.Вставить("МотоЧасыТО");
	ДанныеПрицепОборудование.Вставить("МотоЧасыФакт");
	ДанныеПрицепОборудование.Вставить("ОстатокТоплива");
	ДанныеПрицепОборудование.Вставить("Пробег");
	ДанныеПрицепОборудование.Вставить("Комментарий");
	
	Возврат ДанныеПрицепОборудование;
	
КонецФункции

#Область Инициализация

Иницаилизировать();

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
